app/controllers/api/sneakers_controller.rb

    def index
        @sneakers = Sneaker.all
---
SELECT "sneakers".* FROM "sneakers"